<B>It happens all the time: someone gives you data containing malformed strings, Python,
lists and missing data. How do you tidy it up so you can get on with the analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:</B>

In [88]:
import pandas as pd
import numpy as np

In [194]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [195]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

The From_To column would be better as two separate columns! Split each string on
the underscore delimiter _ to give a new temporary DataFrame with the correct values.
Assign the correct column names to this temporary DataFrame.

In [196]:
# This block will split the values to indiviual series based on the delimiter  
df['From']= df['From_To'].str.split('_').str[0]
df['To']= df['From_To'].str.split('_').str[1]
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,NaN,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,NaN,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,londOn

Notice how the capitalisation of the city names is all mixed up in this temporary
DataFrame. Standardise the strings so that only the first letter is uppercase (e.g.
"londON" should become "London".)

In [197]:
#  This code will change the case of the series From
df['From']=df['From'].str.title()

In [198]:
#  This code will change the case of the series To
df['To']=df['To'].str.title()

In [199]:
#Display the Dataframe
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,NaN,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,NaN,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,London

In [200]:
#Assign the DF to a new dataframe variable and drop the series From_to
df_updated= df.drop(['From_To'],axis=1)

In [201]:
#Display the updated dataframe df_updated
df_updated

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1           NaN            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3           NaN          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [126]:
df['FlightNumber'].apply(lambda x: 0 if pd.isnull(x) else 1)

0    1
1    1
2    1
3    1
4    1
Name: FlightNumber, dtype: int64

Some values in the the FlightNumber column are missing. These numbers are meant
to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in
these missing numbers and make the column an integer column (instead of a float
column).

In [136]:
#Method 1: Update the series Flight# using the for loop
for i in range(df.FlightNumber.count() + 1):
    print(i)
    if pd.isnull(df.FlightNumber.loc[i,]):
        df.loc[i,'FlightNumber'] = df.FlightNumber.loc[i-1,] + 10
        print(df.FlightNumber.loc[i,])

0
1
10055.0
2
3
10075.0

In [132]:
#Method 2: Update the series Flight# using the apply and lamda
df['FlightNumber'].apply(lambda x: (x-1+10) if x is None else x)

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [202]:
#Method 3: Update the series Flight# using Numpy
FlightNo=np.arange(min(df_updated["FlightNumber"]),max(df_updated["FlightNumber"])+10,10,dtype=int)

In [ ]:
#Method 4: Update the series Flight# using Interpolate method
df['FlightNumber']=df['FlightNumber'].interpolate().astype(int)

In [203]:
#Using the Method 3- Assign the dataframe "FlightNo with the updated values in Seriies
df_updated['FlightNumber'] =FlightNo

In [204]:
#Display the updated dataframe
df_updated

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In the RecentDelays column, the values have been entered into the DataFrame as a
list. We would like each first value in its own column, each second value in its own
column, and so on. If there isn't an Nth value, the value should be NaN.

In [205]:
#Display the Recentdelays as indiviual series 
delay=pd.DataFrame(df_updated["RecentDelays"].values.tolist()).add_prefix("delay_")

In [206]:
delay

   delay_0  delay_1  delay_2
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [207]:
#Merge the delay to the DF_update dataframe
df_updated=df_updated.merge(delay,left_index=True,right_index=True)

In [211]:
#Assign the DF to a new dataframe variable and drop the series RecentDelays
df_updated= df.drop(['RecentDelays','From_To'],axis=1)

In [212]:
df_updated

   FlightNumber              Airline      From         To
0       10045.0               KLM(!)    London      Paris
1           NaN    <Air France> (12)    Madrid      Milan
2       10065.0  (British Airways. )    London  Stockholm
3           NaN       12. Air France  Budapest      Paris
4       10085.0          "Swiss Air"  Brussels     London